Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
                         }
                              + refId          = "A"
                              + step           = 20
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "system_threads"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 9
                          + w = 8
                          + x = 16
                          + y = 0
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "rate(wmi_system_exception_dispatches_total{instance=~\"$server\"}[$interval])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "exceptions"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 20
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "System exception dispatches"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 7
                          + w = 10
                          + x = 0
                          + y = 9
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "irate(wmi_net_packets_outbound_discarded{instance=~\"$server\", nic!~\"isatap.+\"}[$interval]) + irate(wmi_net_packets_outbound_errors{instance=~\"$server\"}[$interval])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Sent {{nic}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "B"
                              + step           = 15
                            },
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "irate(wmi_net_packets_received_discarded{instance=~\"$server\", nic!~\"isatap.+\"}[$interval]) + irate(wmi_net_packets_received_errors{instance=~\"$server\"}[$interval])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Received {{nic}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 15
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Network discarded/error packets"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 2
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 7
                          + w = 14
                          + x = 10
                          + y = 9
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "rate(wmi_net_bytes_sent_total{instance=~\"$server\"}[$interval]) >0"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Sent {{nic}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "B"
                              + step           = 10
                            },
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "- rate(wmi_net_bytes_received_total{instance=~\"$server\"}[$interval]) <0"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Received {{nic}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 10
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Network"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 2
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 2
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 6
                          + w = 8
                          + x = 0
                          + y = 16
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "irate(wmi_logical_disk_write_bytes_total{instance=~\"$server\", volume !~\"HarddiskVolume.+\"}[$interval])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Write {{volume}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 20
                            },
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "- irate(wmi_logical_disk_read_bytes_total{instance=~\"$server\", volume !~\"HarddiskVolume.+\"}[$interval])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Read {{volume}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "B"
                              + step           = 20
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Hard drive load"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "decbytes"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 6
                          + w = 8
                          + x = 8
                          + y = 16
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "rate(wmi_logical_disk_split_ios_total{instance=~\"$server\", volume !~\"HarddiskVolume.+\"}[30s])"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "i/o {{volume}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 20
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Hard disk i/o ops total"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 6
                          + w = 8
                          + x = 16
                          + y = 16
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "wmi_logical_disk_free_bytes{instance=~\"$server\", volume !~\"HarddiskVolume.+\"}"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "free {{volume}}"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 20
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Hard disk free space"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "decbytes"
                              + logBase = 1
                              + min     = "0"
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors      = {}
                      + bars             = false
                      + dashLength       = 10
                      + dashes           = false
                      + datasource       = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill             = 1
                      + fillGradient     = 0
                      + gridPos          = {
                          + h = 6
                          + w = 24
                          + x = 0
                          + y = 22
                        }
                      + hiddenSeries     = false
                      + hideTimeOverride = false
                      + legend           = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = true
                          + max          = true
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = true
                        }
                      + lines            = true
                      + linewidth        = 1
                      + links            = []
                      + nullPointMode    = "null as zero"
                      + options          = {
                          + alertThreshold = true
                        }
                      + percentage       = false
                      + pluginVersion    = "8.5.3"
                      + pointradius      = 5
                      + points           = false
                      + renderer         = "flot"
                      + seriesOverrides  = []
                      + spaceLength      = 10
                      + stack            = false
                      + steppedLine      = false
                      + targets          = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "wmi_os_virtual_memory_bytes{instance=~\"$server\"}"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Virtual memory"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 5
                            },
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "wmi_cs_physical_memory_bytes{instance=~\"$server\"}"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Physical memory"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "B"
                              + step           = 5
                            },
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "wmi_os_physical_memory_free_bytes{instance=~\"$server\"}"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + hide           = false
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "Free physical memory"
                              + metric         = "mysql_global_status_questions"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "C"
                              + step           = 5
                            },
                        ]
                      + thresholds       = []
                      + timeRegions      = []
                      + title            = "Memory"
                      + tooltip          = {
                          + shared     = false
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type             = "graph"
                      + xaxis            = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes            = [
                          + {
                              + format  = "decbytes"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis            = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors     = {
                          + "Received mysqld-exporter:9104" = "#0A50A1"
                          + stopped                         = "#2F575E"
                        }
                      + bars            = false
                      + datasource      = {
                          + type = "Prometheus"
                          + uid  = "qxMo9OZgk"
                        }
                      + fill            = 10
                      + gridPos         = {
                          + h = 6
                          + w = 24
                          + x = 0
                          + y = 28
                        }
                      + legend          = {
                          + alignAsTable = true
                          + avg          = false
                          + current      = false
                          + max          = false
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + total        = false
                          + values       = false
                        }
                      + lines           = true
                      + linewidth       = 0
                      + links           = []
                      + nullPointMode   = "null as zero"
                      + percentage      = false
                      + pointradius     = 5
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + stack           = true
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + application    = {
                                  + filter = ""
                                }
                              + expr           = "sum(wmi_service_state{instance=~\"$server\"}) by (state)"
                              + functions      = []
                              + group          = {
                                  + filter = ""
                                }
                              + host           = {
                                  + filter = ""
                                }
                              + intervalFactor = 1
                              + item           = {
                                  + filter = ""
                                }
                              + legendFormat   = "{{state}}"
                              + mode           = 0
                              + options        = {
                                  + showDisabledItems = false
                                }
                              + refId          = "A"
                              + step           = 5
                            },
                        ]
                      + thresholds      = []
                      + title           = "Services by state"
                      + tooltip         = {
                          + shared     = true
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "Bps"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = false
                            },
                        ]
                    },
                ]
              + refresh              = "10s"
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = [
                  + "windows",
                  + "wmi_exporter",
                  + "Prometheus",
                ]
              + templating           = {
                  + list = [
                      + {
                          + auto        = false
                          + auto_count  = 500
                          + auto_min    = "30s"
                          + current     = {
                              + selected = false
                              + text     = "60s"
                              + value    = "60s"
                            }
                          + hide        = 2
                          + label       = "Interval"
                          + name        = "interval"
                          + options     = [
                              + {
                                  + selected = true
                                  + text     = "60s"
                                  + value    = "60s"
                                },
                            ]
                          + query       = "60s"
                          + refresh     = 2
                          + skipUrlSync = false
                          + type        = "interval"
                        },
                      + {
                          + current        = {
                              + selected = false
                              + text     = "192.168.1.7:9182"
                              + value    = "192.168.1.7:9182"
                            }
                          + datasource     = {
                              + type = "Prometheus"
                              + uid  = "qxMo9OZgk"
                            }
                          + definition     = ""
                          + hide           = 0
                          + includeAll     = false
                          + label          = "Server"
                          + multi          = false
                          + name           = "server"
                          + options        = []
                          + query          = {
                              + query = "label_values(wmi_system_system_up_time, instance)"
                              + refId = "Prometheus-server-Variable-Query"
                            }
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                    ]
                }
              + time                 = {
                  + from = "now-3h"
                  + to   = "now"
                }
              + timepicker           = {
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                  + time_options      = [
                      + "5m",
                      + "15m",
                      + "1h",
                      + "6h",
                      + "12h",
                      + "24h",
                      + "2d",
                      + "7d",
                      + "30d",
                    ]
                }
              + timezone             = "browser"
              + title                = "Windows Node"
              + uid                  = "MRxYufggz"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_data_source.elasticsearch will be created
+ resource "grafana_data_source" "elasticsearch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + database_name      = "filebeat-*"
      + id                 = (known after apply)
      + is_default         = false
      + name               = "Elasticsearch"
      + type               = "elasticsearch"
      + uid                = (known after apply)
      + url                = "http://elastic.server.local.net"

      + json_data {
          + es_version = "7.10.0"
          + time_field = "@timestamp"
        }
    }

  # grafana_data_source.prometheus will be created
+ resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "Prometheus"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "http://prometheus.local.net"
    }

  # grafana_folder.containers will be created
+ resource "grafana_folder" "containers" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Containers"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # grafana_folder.general will be created
+ resource "grafana_folder" "general" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Homelab"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

  # grafana_folder.network will be created
+ resource "grafana_folder" "network" {
      + id                           = (known after apply)
      + prevent_destroy_if_not_empty = false
      + title                        = "Network"
      + uid                          = (known after apply)
      + url                          = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with grafana_data_source.elasticsearch,
│   on datasources.tf line 7, in resource "grafana_data_source" "elasticsearch":
│    7: resource "grafana_data_source" "elasticsearch" {
│ 
│ Use json_data_encoded instead.
│ 
│ (and one more similar warning elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d apps/grafana`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.mvaldes.dev/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgrafana%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d apps/grafana`
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---
### 2. dir: `.` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -upgrade" in "/home/atlantis/.atlantis/repos/mvaldes14/terraform/1/default": exit status 1

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Finding latest version of hashicorp/grafana...
- Installing hashicorp/aws v5.0.1...
- Installed hashicorp/aws v5.0.1 (signed by HashiCorp)
╷
│ Error: Failed to query available provider packages
│ 
│ Could not retrieve the list of available versions for provider
│ hashicorp/grafana: provider registry registry.terraform.io does not have a
│ provider named registry.terraform.io/hashicorp/grafana
│ 
│ Did you intend to use grafana/grafana? If so, you must specify that source
│ address in each module which requires that provider. To see which modules
│ are currently depending on hashicorp/grafana, run the following command:
│     terraform providers
╵


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`